In [1]:
import pandas as pd

In [2]:
from sklearn.datasets import load_iris

In [3]:
df = load_iris()

In [6]:
df = pd.DataFrame(data=df['data'], columns=df['feature_names'] )

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [8]:
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [9]:
df.tail()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

In [13]:
example_1 = pd.Series([1, 4, 65, None, 32, 'SD'])

In [14]:
example_1.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [15]:
example_1.notnull()

0     True
1     True
2     True
3    False
4     True
5     True
dtype: bool

In [16]:
example_1.dropna()

0     1
1     4
2    65
4    32
5    SD
dtype: object

In [52]:
import numpy as np
example_2 = pd.DataFrame([[2, None , 43], 
[23, 32, None]] )
example_2

    0     1     2
0   2   NaN  43.0
1  23  32.0   NaN

In [49]:
example_2.fillna(example_2.mean())

    0     1     2
0   2  32.0  43.0
1  23  32.0  43.0

In [54]:
example_3 = pd.Series([2, 3, 4, None, 5, 6])
example_3

0    2.0
1    3.0
2    4.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [58]:
example_3.fillna(method = 'bfill')

0    2.0
1    3.0
2    4.0
3    5.0
4    5.0
5    6.0
dtype: float64

In [24]:
example_2

    0     1     2
0   2   NaN  43.0
1  23  32.0   NaN

In [25]:
example_2.dropna()

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [27]:
example_2.dropna(axis=1)

    0
0   2
1  23

In [26]:
example_2.dropna?

Signature:
example_2.dropna(
    axis=0,
    how='any',
    thresh=None,
    subset=None,
    inplace=False,
)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. versionchanged:: 1.0.0

       Pass tuple or list to drop on multiple axes.
       Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame or None
    DataFrame with NA entries dropped from it or None if ``inplace=True``.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'toy'])
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      c:\users\inncreator\appdata\local\programs\python\python39\lib\site-packages\pandas\core\frame.py
Type:      method

In [28]:
example_2.duplicated()

0    False
1    False
dtype: bool

In [37]:
example_2 = pd.DataFrame([['2', 4 , 4], 
[23, 32, 32], [23, 32, 32]] )

In [34]:
example_2

    0   1   2
0   2   4  43
1  23  32  32

In [38]:
example_2.duplicated()

0    False
1    False
2     True
dtype: bool

In [39]:
example_2.drop_duplicates()

    0   1   2
0   2   4   4
1  23  32  32

In [42]:
exampe = pd.DataFrame({'names': ['Mary', 'John', 'Mary'],
'age': [2, 23, 1]})
exampe

  names  age
0  Mary    2
1  John   23
2  Mary    1

In [43]:
exampe.drop_duplicates('names')

  names  age
0  Mary    2
1  John   23

In [61]:
example_1

0       1
1       4
2      65
3    None
4      32
5      SD
dtype: object

In [64]:
example_2

    0     1     2
0   2   NaN  43.0
1  23  32.0   NaN